import java.util.Scanner;
public class booleanHM {
    public static void main(String[] args){
        Scanner in=new Scanner(System.in);
        /*
--------Кучмель Павел---------------------------------------------------------------------------------------------
         */
        //Boolean1.
        //Дано целое число A. Проверить истинность высказывания: «Число A является положительным».
        /*
        System.out.print("Введите число: ");
        int a=in.nextInt();
        boolean m=a>0;
        System.out.println(m);
         */
        /*
------------------------------------------------------------------------------------------------------------------
         */
        //Boolean2
        //Дано целое число A. Проверить истинность высказывания: «Число A является нечетным».
        /*
        System.out.print("Введите число: ");
        int a=in.nextInt();
        int a1=a%2;
        boolean m=a1==1;
        System.out.println(m);
        */
        /*
----------------------------------------------------------------------------------------------------------------
         */
    }
}
